In [1]:
import pandas as pd

In [2]:
# Files to load
client_data_to_load = "../files/Current_Clients.csv"
leads_data_to_load = "../files/leads.csv"

In [3]:
# Read in the files
client_data_df = pd.read_csv(client_data_to_load)
leads_data_df = pd.read_csv(leads_data_to_load)

In [4]:
# Examine leads_data_df
leads_data_df.head(10)

    first_name last_name   age  gender      debt         city state   zip
0       Terrye   Gunnell  60.0  Female  $101,876  Springfield    MA  1152
1      Rodolph      Gerb  47.0    Male   $92,052    Worcester    MA  1605
2       Glynis   D'orsay  56.0  Female   $72,343    Worcester    MA  1654
3        Alvie   Vennart  73.0    Male   $76,304       Woburn    MA  1813
4     Brantley   Chalker  87.0    Male   $22,570       Boston    MA  2114
5       Sharon   Munehay  62.0  Female   $59,415       Boston    MA  2119
6          Lek  Boundley  31.0    Male   $80,797       Boston    MA  2163
7        Lorri     Gypps  21.0  Female   $45,237       Boston    MA  2208
8       Danita   Bracken  59.0  Female   $63,068     Brockton    MA  2305
9  Bartholomeo  Gartrell  80.0    Male   $79,804     Brockton    MA  2305

In [5]:
# Examine client_data_df
client_data_df

     Client ID First Name Last Name            City State    ZIP
0            1   Vincenty   Vanyard       Hollywood    FL  33028
1            2     Pattie  Okeshott      Scottsdale    AZ  85271
2            3     Olenka  Blackler         Phoenix    AZ  85020
3            4    Georgia      Elby  Virginia Beach    VA  23454
4            5    Sheelah    Petris       Cleveland    OH  44111
..         ...        ...       ...             ...   ...    ...
175        176    Crystal    Ratley       Henderson    NV  89074
176        177     Talbot   McTerry  San Bernardino    CA  92415
177        178    Granger   Goudard          London    KY  40745
178        179     Sarene      Lowy   Boynton Beach    FL  33436
179        180      Vanya    Lamond         Houston    TX  77245

[180 rows x 6 columns]